{
    "count": "2",
    "list": [
        {
            "version": "2.6.3011",
            "date": "Released on 2/21/2018",
            "notes": {
                "improved": [
                    "Reverted the run chart fix from the previous release, as it broke backwards compatibility."
                ],
                "fixed": [
                    "Fixed an error that occurred when displaying run charts in some cases."
                ]
            }
        },
        {
            "version": "2.6.3010",
            "date": "Released on 2/20/2018",
            "notes": {
                "improved": [
                    "The Control Panel now sets the <code>origin-when-cross-origin</code> referrer policy.",
                    "Rich Text fields no longer parse reference tags that aren’t within a <code>href</code> or <code>src</code> attribute when displaying their form input, so the tags don’t get lost when the element is re-saved."
                ],
                "fixed": [
                    "Fixed a bug where run charts (e.g. the New Users widget) would always show zero results if MySQL wasn’t configured with time zone data.",
                    "Fixed a bug where the New Users widget would show 8 days worth of data when its Date Range setting was set to",
                    "Fixed a bug where the New Users widget could be missing some data if the browser time zone wasn’t the same as the system time zone."
                ]
            }
        },
        {
            "version": "2.6.3009",
            "date": "Released on 2/13/2018",
            "notes": {
                "added": [
                    "Added <code>StringHelper::encenc()</code> and <code>decdec()</code>.",
                    "Added the <code>|encenc</code> Twig filter."
                ],
                "improved": [
                    "The first column on user index tables is now labeled “User”, and there are now always dedicated “Username” and “Email” columns available.",
                    "Email passwords are now encrypted in email settings forms."
                ],
                "fixed": [
                    "Fixed a bug where Craft would not save newly-assigned license keys if a <code>craft/config/license.key</code> file existed, even if it didn’t contain a valid license key.",
                    "Fixed a bug where the “Save” button wasn’t visible on custom field layout tabs on Edit User pages.",
                    "Fixed a bug where Craft would issue unsaved data warnings when leaving edit pages, if the form data had been modified from the <code>jQuery(document).ready()</code> event."
                ]
            }
        }
    ]
}
